
/*for (let i=1; i<11; i++) {
    let x = 7*i;
    
    
    console.log(x);
}  */


/*George S, [20.08.18 18:13]
Вот еще пару задач на циклы:
1) Пользователь ввел число n (через prompt) посчитать сумму чисел от 1 до n.
Пример:
ввели 5
ответ 15 ( т.к. 1+2+3+4+5 = 15)

George S, [20.08.18 18:15]
2)Пользователь ввел число n (через prompt). Дальше поочередно вводин n чисел, посчитать их сумму.
Пример 
ввели 3 (т.е. будет 3 числа)
ввели 1
ввели -2
ввели 10
ответ 9 (т.к. 1+(-2)+10=9)
*/

prompt("Введите число", "")

let sum = 0
for (i=1; i<=n; i++) {
    sum = sum + i;

}
console.log(sum);




//j=120
//j=j+10
//console.log(j) 







//let i;



/*for ( i=3;i<11;i=i+3){
    console.log(i);
}*/

/*for (i=100; i>0 ; i=i+1){
    console.log(i);
}*/

////for (let i=0;i<10;i++){
//    console.log(i);
//    let a=3;
//}