//есть число g (придумай сам чему равно)
//и цикл выдающий цифры от 1 до 100
//Дать ответ на вопрос сколько чисел больших g
//Пример:
//g=13
//...
//ответ: 87

//let g = 10;
//let count = 0;
//
//for (i=1; i<=100; i++)
//    if (i>g) {
//        count++
//    }
//    console.log(i);
//    console.log(count);
//Почему в console 101 а не 100?

//2) Пользователь вводит последовательно через prompt 3 числа: a,b и с.
//По заданным введенным числам составить ряд (с помощью цикла) где а - начало, b -конец, c -шаг
//Нарпимер:
//a = 3; b = 15; c =4
//ряд 3 7 11 15

//let a = prompt("Number a", "");
//let b = prompt("Number b", "");
//let c = prompt("Number c", "");
//
//for (i=a; i<=b; i=i+c);
//    console.log(i);


    
    
    
//
//3) Найти среднее арифметическое всех целых чисел от а до b (значения а и b вводятся с помощью prompt)

prompt("Number", "");

let a = prompt("Number a", "");
let b = prompt("Number b", "");

for (i=1; i<=100; i++);
 if 
    


