// //  1) Есть число b, задачется в коде. необходимо вывести таблицу умножения для этого числа.
// Например для b = 4
// 4 8 12 16 ... 40

// var b = 4;
// for (var i = 1; i <=10; i++) {
//     document.write(b + " * " + i + " = " + b  *  i + "<br>" );
// }



/*---------------------------------------------------*/

// 2) Есть массив чисел. Увеличить все числа на 10
// массив  до [ 0, -2, 3, 5, -1, 11]
// массив после [2, 0, 3,7, 1, 13]

// var array = [ 0, -2, 3, 5, -1, 11];


// for (var i =0; i<array.length; i++) {
//     array[i] = array[i] + 10
//     console.log(array[i]);
// }
// console.log(array);





// 3) есть массив чисел. Заменить все числа которые больше первого на первое
// массив до [5, 11, 22, 3, 1, 15], т.е. первое число 5
// массив после [5, 5, 5, 3,1, 5]

// var array = [5, 11, 22, 3, 1, 15];

// for (var i = 0;  i < array.length; i++) {
//     if(array[i] > array[0]) {
//         array[i] = array[0];
       
//     }
// }
// console.log(array); 